Revit 2024 API
DialogBoxData Members
The DialogBoxData type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
OverrideResult
 Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
HelpId
 An ID that represents the dialog that has been displayed.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace